{
    "success": true,
    "meals": {
        "breakfast": {
            "_id": "68ce9b6ab3204c3d4bd7bbe1",
            "mealName": "Rava Upma",
            "category": [
                "Breakfast"
            ],
            "cuisine": "South",
            "vegan": false,
            "vegetarian": true,
            "glutenFree": false,
            "lactoseFree": false,
            "keto": false,
            "ingredients": [
                "1 cup semolina (rava)",
                "1 large onion, chopped",
                "1-2 green chilies, slit",
                "1 teaspoon mustard seeds",
                "1 teaspoon urad dal (split black lentils)",
                "1 teaspoon chana dal (split Bengal gram)",
                "A few curry leaves",
                "1/2 inch ginger, grated or finely chopped",
                "2 cups water (or a 1:2 ratio of rava to water)",
                "2 tablespoons oil or ghee",
                "Salt to taste",
                "Fresh coriander leaves for garnish"
            ],
            "instructions": [
                "Dry roast the semolina in a pan over low to medium heat until it becomes aromatic and light golden. Transfer to a bowl and set aside.",
                "Heat oil or ghee in the same pan. Add mustard seeds and let them splutter.",
                "Add chana dal and urad dal and fry until they turn light golden. Some people also add cashews or peanuts at this stage for added crunch.",
                "Add curry leaves, chopped onions, green chilies, and ginger. Sauté until the onions turn translucent. You can also add finely chopped vegetables like carrots, beans, or peas for a more nutritious dish.",
                "Pour in the water and add salt. Bring to a rolling boil.",
                "Slowly sprinkle the roasted semolina into the boiling water while stirring continuously with the other hand to prevent lumps from forming.",
                "Continue to stir until all the water is absorbed and the mixture thickens into a porridge-like consistency.",
                "Cover the pan and cook on low heat for 2-3 minutes to allow the rava to absorb moisture and become soft and fluffy.",
                "Garnish with fresh coriander leaves and serve hot with chutney or sambar."
            ],
            "description": "Rava Upma is a popular and simple South Indian breakfast dish made from semolina (rava), which is cooked with a tempering of spices, lentils, and sometimes vegetables. It's a quick and filling meal that is commonly enjoyed all over India.",
            "__v": 0
        },
        "lunch": {
            "_id": "68ce9b6ab3204c3d4bd7bbdf",
            "mealName": "Vegetable Biryani",
            "category": [
                "Lunch",
                "Dinner"
            ],
            "cuisine": "North",
            "vegan": false,
            "vegetarian": true,
            "glutenFree": false,
            "lactoseFree": false,
            "keto": false,
            "ingredients": [
                "2 cups basmati rice, rinsed and drained",
                "2 tablespoons ghee (clarified butter), or olive oil",
                "1 red onion, cut into 1/2-inch dice",
                "½ teaspoon cumin seed",
                "1 (1 inch) piece cinnamon stick",
                "7 peppercorns",
                "1 tablespoon ginger garlic paste",
                "1 tomato, diced",
                "½ cup peas",
                "½ cup diced carrot",
                "½ cup diced potato",
                "1 cube chicken bouillon (can be replaced with vegetable bouillon)",
                "1 teaspoon salt",
                "¼ teaspoon ground red chile pepper",
                "¼ teaspoon black pepper",
                "½ teaspoon garam masala",
                "¼ teaspoon ground turmeric",
                "4 cups water",
                "1/4 cup cream or milk"
            ],
            "instructions": [
                "Melt ghee in a large Dutch oven over medium heat. Add onion, and cook until softened, about 3 minutes. Stir in cumin seed, cinnamon stick, and peppercorns; cook until the spices are fragrant, and the cumin seeds begin to pop, about 3 minutes.",
                "Stir in ginger garlic paste, tomatoes, and 1/2 cup water. Bring to a simmer, and cook until the water has evaporated, about 5 minutes. Stir in peas, carrot, and potato. Season with chicken bouillon, salt, red chile, black pepper, garam masala, and turmeric. Stir well, then cover, and cook for 3 minutes.",
                "Pour in 4 cups water and bring to a boil over high heat. Once boiling, stir in basmati rice, reduce heat to medium, recover, and simmer for 10 minutes. Reduce heat to low and continue to cook until the rice has softened, 10 to 15 minutes more.",
                "To finish, you can top the rice with some fresh coriander leaves and fried onions before serving."
            ],
            "description": "Vegetable Biryani is a flavorful and aromatic rice dish made with a blend of fragrant spices, mixed vegetables, and basmati rice. It is a complete meal on its own and a popular Indian dish.",
            "__v": 0
        },
        "dinner": {
            "_id": "68ce9b6ab3204c3d4bd7bbe2",
            "mealName": "Pongal",
            "category": [
                "Breakfast",
                "Dinner"
            ],
            "cuisine": "South",
            "vegan": false,
            "vegetarian": true,
            "glutenFree": true,
            "lactoseFree": false,
            "keto": false,
            "ingredients": [
                "1 cup rice",
                "1/4 cup moong dal (split yellow lentils)",
                "2 cups water",
                "1 teaspoon ghee (clarified butter)",
                "1 teaspoon cumin seeds",
                "1 teaspoon whole black peppercorns",
                "1 inch ginger, chopped",
                "A few curry leaves",
                "1/4 cup cashews",
                "Salt to taste"
            ],
            "instructions": [
                "In a pressure cooker, dry roast the rice and moong dal over medium heat until a light aroma is released. This helps the dish cook faster and taste better.",
                "Add water and salt to the rice and dal mixture. Pressure cook for about 3-4 whistles or until the rice and dal are very soft and mushy.",
                "In a separate small pan, heat ghee. Add cumin seeds, whole peppercorns, chopped ginger, and curry leaves. Sauté until the cumin seeds splutter and the peppercorns begin to pop.",
                "Add the cashews and fry until they turn golden brown.",
                "Pour this tempering mixture over the cooked rice and dal.",
                "Mix everything well and serve hot. For a richer flavor, you can add an extra spoonful of ghee."
            ],
            "description": "Pongal is a comforting South Indian dish made by cooking rice and moong dal together into a soft, porridge-like consistency. It is seasoned with a tempering of spices like ginger, black pepper, and cumin seeds and often topped with cashews. Ven Pongal is the savory version of this meal, which is often served with sambar and coconut chutney.",
            "__v": 0
        }
    },
    "cuisinePreference": [
        "North",
        "South"
    ]
}